# Set clock period to constrain path-2-path paths
create_clock -name clk -period 2.6 [get_ports clk]
set_dont_touch_network [get_clocks clk]

# Set input delay to constrain input paths to first register banks; if any 
set_input_delay -max 2 -clock [get_clocks clk] [remove_from_collection [all_inputs] [get_ports clk]]

# Set output delay to constrain output banks of registers to output primary ports; if any 
set_output_delay -max 2 -clock [get_clocks clk] [all_outputs]

# Estimate any clock non-idealities; such as future clock skews, jitter, and any margin
set_clock_uncertainty 0.35 [get_clocks]

# Disable hold time checking and optimization for all paths in the design
set_false_path -hold -from [remove_from_collection [all_inputs] [get_ports clk]]
set_false_path -hold -to [all_outputs]

# Set the maximum area of the design to 0 to get the smallest possible area
set_max_area 0
